# CannotCreatePanelScheduleDuetoNoDefaultTemplate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..CannotCreatePanelScheduleDuetoNoDefaultTemplate Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreatePanelScheduleDuetoNoDefaultTemplate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreatePanelScheduleDuetoNoDefaultTemplate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreatePanelScheduleDuetoNoDefaultTemplate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace